Updating README by adding better diagrams
